blogs/zombie-with-init-parent.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-20 一 18:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>构造父进程为init的僵尸进程</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">构造父进程为init的僵尸进程</h1>
<p>
僵尸进程的父进程为init，这非常不正常，僵尸进程的出现是因为进程缺乏父进程收割，而init作为父进程会定期收割子进程，这互相矛盾。先了解一些基本概念。
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 孤儿进程和init</h2>
<div class="outline-text-2" id="text-1">
<p>
每个进程都有父进程，这点从 <code>pstree</code> 可以看出，init是所有进程的祖先。当一个进程的父进程先于自己退出，它的父进程就变成了init进程。执行 <code>(sleep 30 &amp;)</code> ，sleep进程变成了孤儿进程。注意这里的括号。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> 僵尸进程</h2>
<div class="outline-text-2" id="text-2">
<p>
僵尸进程（进程名称带有 <code>&lt;defunct&gt;</code> ），是进程退出了，但是父进程没有收割它（调用wait函数）。此时进程所占用的资源都被尽可能的释放了，但是仍然占用一个PID，直到父进程调用wait函数（获取进程的退出状态）。为了避免进程进入僵尸状态，父进程可以 <code>wait</code> 子进程，或者处理 <code>SIGCHLD</code> 信号，最简单的处理方式是 <code>signal(SIGCHLD, SIG_IGN)</code> 。 下面的shell演示了僵尸进程。
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #ffff00;"># </span><span style="color: #ffff00;">(sleep 10 &amp; exec /bin/sleep 60) &amp;</span>
[7] 9005
<span style="color: #ffff00;"># </span><span style="color: #ffff00;">ps -ef | grep sleep; sleep 10; echo "'sleep 10' becomes zombie"; ps -ef | grep sleep; echo "kill zombie's parent process ${!}, zombie disappeared"; kill ${!}; ps -ef | grep sleep</span>
root      9005 20790  0 16:33 pts/6    00:00:00 /bin/sleep 60
root      9007  9005  0 16:33 pts/6    00:00:00 sleep 10
root      9015 20790  0 16:33 pts/6    00:00:00 grep sleep
<span style="color: #00ff00;">'sleep 10'</span> becomes zombie
root      9005 20790  0 16:33 pts/6    00:00:00 /bin/sleep 60
root      9007  9005  0 16:33 pts/6    00:00:00 [sleep] &lt;defunct&gt;
root      9018 20790  0 16:33 pts/6    00:00:00 grep sleep
<span style="color: #0000ff; font-weight: bold;">kill</span> zombie<span style="color: #00ff00;">'s parent process 9005, zombie disappeared</span>
<span style="color: #00ff00;">root      9020 20790  0 16:33 pts/6    00:00:00 grep sleep</span>
</pre>
</div>

<p>
稍微解释下： <code>(sleep 10 &amp; exec /bin/sleep 60)</code> 在子shell中启动sleep 10，然后用sleep 60替代子shell，此时sleep 60作为sleep 10的父进程，它显然不会收割sleep 10，所以sleep 10结束后就变成了僵尸进程。因为sleep 60肯定不会收割sleep 10，sleep 10只有等sleep 60结束，sleep 10的父进程变成init，init收割它。这里我们显式kill了sleep 60，让init收割sleep 10。
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> init 不收割僵尸进程</h2>
<div class="outline-text-2" id="text-3">
<p>
这就怪了。init进程作为父进程，核心用处是收割子进程，那怎么还会有僵尸进程呢？有没有可能init无法成功收割呢？下面就尝试构造init无法收割的僵尸进程。
</p>

<p>
准备程序： <code>gcc -Wall -o zombie zombie.c -lpthread</code>
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #0000ff; font-weight: bold;">#include</span> <span style="color: #00ff00;">&lt;stdio.h&gt;</span>
<span style="color: #0000ff; font-weight: bold;">#include</span> <span style="color: #00ff00;">&lt;stdlib.h&gt;</span>
<span style="color: #0000ff; font-weight: bold;">#include</span> <span style="color: #00ff00;">&lt;unistd.h&gt;</span>
<span style="color: #0000ff; font-weight: bold;">#include</span> <span style="color: #00ff00;">&lt;pthread.h&gt;</span>

<span style="color: #00ff00;">void</span> *<span style="color: #0000ff; font-weight: bold;">routine</span>(<span style="color: #00ff00;">void</span> *<span style="color: #ffff00;">data</span>) {
  <span style="color: #00ff00;">FILE</span> *<span style="color: #ffff00;">fp</span> = fopen(<span style="color: #00ff00;">"/mnt/test"</span>, <span style="color: #00ff00;">"a"</span>);
  fprintf(fp, <span style="color: #00ff00;">"pid %d\n"</span>, getpid());
  fclose(fp);
  <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #ff00ff;">NULL</span>;
}<span style="color: #00ff00;">int</span> <span style="color: #0000ff; font-weight: bold;">main</span>(<span style="color: #00ff00;">int</span> <span style="color: #ffff00;">argc</span>, <span style="color: #00ff00;">char</span> *<span style="color: #ffff00;">argv</span>[]) {
  <span style="color: #00ff00;">pthread_t</span> <span style="color: #ffff00;">tid</span>;
  pthread_create(&amp;tid, <span style="color: #ff00ff;">NULL</span>, routine, <span style="color: #ff00ff;">NULL</span>);
  sleep(5);  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">wait thread run</span>
  <span style="color: #00ffff; font-weight: bold;">return</span> EXIT_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-bash">dd <span style="color: #ffff00;">if</span>=/dev/zero <span style="color: #ffff00;">of</span>=/search/filedisk <span style="color: #ffff00;">bs</span>=1k <span style="color: #ffff00;">count</span>=40960
losetup /dev/loop0 /search/filedisk
mkfs -t xfs -f /dev/loop0
mount -t xfs /dev/loop0 /mnt

fsfreeze -f /mnt/  <span style="color: #ffff00;"># </span><span style="color: #ffff00;">suspend access to an filesystem</span>

(./zombie &amp;) &amp;    <span style="color: #ffff00;"># </span><span style="color: #ffff00;">main call exit, becomes zombie, but one thread is hung in kernel, init can't reap it</span>

ps -ef | grep zombie <span style="color: #ffff00;"># </span><span style="color: #ffff00;">root     21913     1  0 17:00 pts/6    00:00:00 [zombie] &lt;defunct&gt;</span>

fsfreeze -u /mnt/  <span style="color: #ffff00;"># </span><span style="color: #ffff00;">remove hung condition, zombie disappeared</span>

losetup -d /dev/loop0
umount /dev/loop0
</pre>
</div>

<p>
从上面的测试看，进程调用exit（main return效果一样）则进程就处于退出状态，但是应该只是一个标记，正在执行的线程不会立即退出（参考：Cancellation Points）。如果线程陷在内核态，则线程不会退出，直到导致陷在内核态的条件解除。
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> 如何消除僵尸进程</h2>
<div class="outline-text-2" id="text-4">
<p>
以上，正常情况不会有僵尸进程，如果有，可能是父进程没有收割。如果父进程是init，那么一定是程序无法正常退出。除了陷在内核态，应该还有很多我不知道的原因。不要想办法消除僵尸进程，应该想办法不出僵尸进程。
虽然僵尸进程占资源极少，但是如果越积越多，最终会把内核进程表耗尽。值得关注。
</p>

<p>
有传言说telinit可以重启init消除僵尸进程，对上面的例子无效，此外我想不出这种做法消除僵尸进程的机制，毕竟重启init不会导致陷在内核态的线程退出。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2017-11-20 一 18:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
